1 Exercises

1.0.1 pandas dataframes

For each of the next 10 exercises, create a new code cell and write your solution.

1. Import the pandas library with the standard namespace

In [2]:
import pandas as pd

2. Create a pandas dataframe with 1 column named ‘country’ and 4 rows with different country
names

In [13]:
countries = ['France', 'India', 'Bulgaria', 'Brazil']
df1 = pd.DataFrame(countries, columns = ['Country'])
df1

    Country
0    France
1     India
2  Bulgaria
3    Brazil

3. Add a new column named ‘Sales’ and include some numeric values (imagine its sales for
regional brands)

In [14]:
df1['Sales'] = [900,231,452,763]
df1

    Country  Sales
0    France    900
1     India    231
2  Bulgaria    452
3    Brazil    763

4. Use the column country to create an index

In [27]:
df1 = df1.set_index('Country')

5. Create another column called Cost. again, add some numeric values.

In [28]:
df1['Cost'] = [20,40,40,50]
df1

          Sales  Cost  Revenue
Country
France      900    20      880
India       231    40      191
Bulgaria    452    40      412
Brazil      763    50      713

6. Compute a new column Revenue as Sales – Cost.

In [29]:
df1['Revenue'] = df1['Sales']-df1['Cost']
df1

          Sales  Cost  Revenue
Country
France      900    20      880
India       231    40      191
Bulgaria    452    40      412
Brazil      763    50      713

7. What is the shape of the final array?

In [30]:
df1.shape

(4, 3)

8. What is the revenue value for the second country in your dataframe? (write some code to
display only this value as output)

In [31]:
df1[['Revenue']].iloc[1]

Revenue    191
Name: India, dtype: int64